app/controllers/movies_controller.rb

    def index

      @all_ratings =  ['G','PG','PG-13','R']
      @ratings_to_show = @all_ratings
      session[:ratings] = @ratings_to_show

      unless params[:ratings].nil?
        @param_ratings = params[:ratings]
        session[:ratings] = @param_ratings
        @ratings_to_show = params[:ratings].keys
      end

      unless params[:sort].nil?
        @sort = params[:sort]
        session[:sort] = @sort
      end

      if params[:sort].nil? && params[:ratings].nil? && session[:ratings]
        @ratings_to_show = session[:ratings]
        @sort = session[:sort]
        flash.keep
        redirect_to movies_path({sort: session[:sort], ratings: session[:ratings]})
      end

      @movies = Movie.with_ratings(@ratings_to_show)


      if session[:sort]
        @movies = @movies.order(@sort)
---
SELECT "movies".* FROM "movies"